Accessing DataFrame using Index and slicing

In [ ]:
import pandas as pd
df = pd.read_csv('c:/users/rakesh/desktop/Notes/pandascode/student.csv')
print(df)

In [ ]:
print(df[1]) #since dataframe contains rows and columns

#if you want to retrive the record of only one row then use   iloc() method

df.iloc[1]

In [57]:
print(df[1:5:2])

    name  english  math  cs  physics  chemistry
1   amit       56    89  56       67         87
3  vikas       34    67  89       78         67

In [58]:
print(df['name'])

0    rakesh
1      amit
2        jm
3     vikas
4        rk
5     dhruv
Name: name, dtype: object

In [59]:
print(df[['name','english']])  # only list of column name is allowed

     name  english
0  rakesh       45
1    amit       56
2      jm       45
3   vikas       34
4      rk       67
5   dhruv       78

In [60]:
df.iloc[1:4,[1,3,5]]   # iloc() is used to fetch rows or columns using their index values
                       # rows are defined in the form of slicing but columns are defined in the form 
                       # list of index numbers

   english  cs  chemistry
1       56  56         87
2       45  89         66
3       34  89         67

In [61]:
df

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

changing DataFrame's Index

In [62]:
#changing dataFrame's index
df.set_index('name',inplace=True)
df

        english  math  cs  physics  chemistry
name
rakesh       45    87  56       56         78
amit         56    89  56       67         87
jm           45    45  89       67         66
vikas        34    67  89       78         67
rk           67    89  67       67         45
dhruv        78    67  90       56         56

Resetting original INdex

In [63]:
#reseting original index of the dataframe
df.reset_index(inplace=True)
df

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

Change the name of any column

In [64]:
#changing all the column names of a DataFrame
df.columns=['Name','Eng','Maths','CompSc','Phy','Chem']
df

     Name  Eng  Maths  CompSc  Phy  Chem
0  rakesh   45     87      56   56    78
1    amit   56     89      56   67    87
2      jm   45     45      89   67    66
3   vikas   34     67      89   78    67
4      rk   67     89      67   67    45
5   dhruv   78     67      90   56    56

In [65]:
# Below are some quick examples.
# Syntax to change column name using rename() function.
df.rename(columns={"Eng": "English core"})

     Name  English core  Maths  CompSc  Phy  Chem
0  rakesh            45     87      56   56    78
1    amit            56     89      56   67    87
2      jm            45     45      89   67    66
3   vikas            34     67      89   78    67
4      rk            67     89      67   67    45
5   dhruv            78     67      90   56    56

In [66]:
# Using rename() function.
df.rename(columns={'English Core': 'Eng','Maths':'Mathematics'})

     Name  Eng  Mathematics  CompSc  Phy  Chem
0  rakesh   45           87      56   56    78
1    amit   56           89      56   67    87
2      jm   45           45      89   67    66
3   vikas   34           67      89   78    67
4      rk   67           89      67   67    45
5   dhruv   78           67      90   56    56

In [68]:
# Using rename() function.
df.rename(columns={'CompSc': 'Computer'}, inplace=True) 
 #inplace does not display results so we have to display it manually
df

     Name  Eng  Maths  Computer  Phy  Chem
0  rakesh   45     87        56   56    78
1    amit   56     89        56   67    87
2      jm   45     45        89   67    66
3   vikas   34     67        89   78    67
4      rk   67     89        67   67    45
5   dhruv   78     67        90   56    56

In [71]:
# Renaming Multiple columns.  --silently
df.rename({'Name': 'student name', 'Computer': 'IP',
          'Phy': 'Physics'}, axis="columns", inplace=True)
df

  student name  Eng  Maths  IP  Physics  Chem
0       rakesh   45     87  56       56    78
1         amit   56     89  56       67    87
2           jm   45     45  89       67    66
3        vikas   34     67  89       78    67
4           rk   67     89  67       67    45
5        dhruv   78     67  90       56    56

In [74]:
df.columns.values[0]='course'   # change column name silently and does not display it directly
df

   course  Eng  Maths  IP  Physics  Chem
0  rakesh   45     87  56       56    78
1    amit   56     89  56       67    87
2      jm   45     45  89       67    66
3   vikas   34     67  89       78    67
4      rk   67     89  67       67    45
5   dhruv   78     67  90       56    56

Adding a New column in any existing DataFrame

In [76]:
df['music']=[34,45,56,78,78,89]   #add a new column with given values
df

   course  Eng  Maths  IP  Physics  Chem  music
0  rakesh   45     87  56       56    78     34
1    amit   56     89  56       67    87     45
2      jm   45     45  89       67    66     56
3   vikas   34     67  89       78    67     78
4      rk   67     89  67       67    45     78
5   dhruv   78     67  90       56    56     89

In [77]:
df['music'] =100     #replace the values of existing column if column already exists
df

   course  Eng  Maths  IP  Physics  Chem  music
0  rakesh   45     87  56       56    78    100
1    amit   56     89  56       67    87    100
2      jm   45     45  89       67    66    100
3   vikas   34     67  89       78    67    100
4      rk   67     89  67       67    45    100
5   dhruv   78     67  90       56    56    100

In [78]:
df['total']=df['Eng']+df['Maths']+df['IP']+df['Physics']+df['Chem']+df['music']
df

KeyError: 'eng'